import girls1 from "../assets/img/girls-1-min.jpg";
import girls2 from "../assets/img/girls-2-min.jpg";
import products1 from "../assets/img/products-1-min.jpg";
import products2 from "../assets/img/products-2-min.jpg";
import products3 from "../assets/img/products-3-min.jpg";
import products4 from "../assets/img/products-4-min.jpg";
import products5 from "../assets/img/products-5-min.jpg";
import workflow from "../assets/img/workflow-min.jpg";

export default {
  header: {
    logo: "ADC",
    navigation: [
      { ukr: "Переваги", eng: "Benefits", href: "#benefits" },
      { ukr: "Про нас", eng: "About us", href: "#about-us" },
      { ukr: "Продукція", eng: "Products", href: "#products" },
      { ukr: "Послуги", eng: "Services", href: "#services" },
      { ukr: "FAQ", eng: "FAQ", href: "#faq" },
    ],
    locale: {
      ukr: "Укр",
      eng: "Eng",
    },
    action: { ukr: "Контакти", eng: "Contacts" },
  },

  main: {
    title: { ukr: "Ваш стиль витвір", eng: "Your style creation" },
    titleEmp: { ukr: "наш", eng: "our" },
    description: {
      ukr: "Створюємо взуття, яке відповідає вашим найвищим очікуванням",
      eng: "Creating shoes that meet your highest expectations",
    },
    action: { urk: "Обговорити деталі", eng: "Discuss details" },
    details: { ukr: "Детальніше", eng: "More details" },
    img1: girls1,
    img2: products1,
  },

  features: [
    {
      title: { ukr: "Виробництво “під ключ”" },
      description: {
        ukr: "Ми надаємо можливість створити взуття під вашим брендом, використовуючи наші готові моделі. Ви можете обрати дизайн, а також внести зміни в матеріали, кольори, підошви та фурнітуру. Це спрощений спосіб започаткувати власний бренд взуття.",
      },
    },
    {
      title: { ukr: "Клієнтоорієнтований підхід" },
      description: {
        ukr: "Ми не просто виконуємо замовлення, а прагнемо стати вашим надійним партнером. Наша мета — допомогти вам досягти бізнес-цілей, особливо коли власних ресурсів не вистачає.",
      },
    },
    {
      title: { ukr: "Власний Відділ Розробки" },
      description: {
        ukr: "У вас є ідея, але немає ескізу? Не проблема. Наші фахівці створять унікальний дизайн і допоможуть втілити вашу ідею в реальний продукт.",
      },
    },
  ],

  about: {
    title: { ukr: "Про нас" },
    action: { ukr: "Сконтактуйся" },
    description: {
      ukr: "                         Ми – це команда талановитих і відданих своїй справі професіоналів, які щодня створюють якісне та стильне взуття. Уже 7 років Anri De Collo забезпечує виробництво взуття для різних брендів. Ми відповідаємо за повний цикл: від перших ескізів до фінальної перевірки якості. Кожен етап під нашим контролем, щоб ви отримали надійний продукт, готовий до ринку.",
    },
  },

  history: {
    title: { ukr: "Історія компанії" },
    slides: [
      {
        ukr: "Ми — сімейна компанія, заснована у 2017 році в Україні, яка продовжує багаторічні традиції у виробництві якісного жіночого та підліткового взуття. Ми з гордістю створюємо продукцію, яка відповідає найвищим стандартам якості та сучасним трендам.",
      },
      {
        ukr: "Anri De Collo спеціалізується на виробництві взуття як під власним брендом, так і для інших компаній. Від приватних замовників до великих брендів — ми є надійним партнером для тих, хто шукає стабільне та якісне виробництво. ",
      },
      {
        ukr: "З кожним роком ми розширюємо можливості нашого виробництва, збільшуємо команду та вдосконалюємо процеси, що дозволяє нам зростати та впевнено рухатися вперед. Незмінними залишаються наша увага до деталей і прагнення до високої якості.",
      },
      {
        ukr: "Наша місія — створювати взуття, яке підкреслює індивідуальність і просуває українського виробника на світовій арені.",
      },
    ],
  },

  benefits: {
    title: { ukr: "Переваги" },
    slides: [
      {
        title: { ukr: "Висока якість виробництва" },
        description: {
          ukr: "Ми використовуємо високоякісні штучні та екологічно чисті матеріали, а також здійснюємо ретельний контроль на кожному етапі виробництва, щоб гарантувати створення взуття преміальної якості",
        },
      },
      {
        title: { ukr: "Орієнтація на клієнта" },
        description: {
          ukr: "Можливість замовити взуття з урахуванням ваших індивідуальних побажань щодо дизайну, матеріалів та розмірів",
        },
      },
      {
        title: { ukr: "Розумна ціна" },
        description: {
          ukr: "Прямі постачання та ефективні процеси дозволяють нам пропонувати конкурентоспроможну ціну",
        },
      },
      {
        title: { ukr: "Надійні партнерські відносини" },
        description: { ukr: "Працюємо на основі чітких договорів та гарантій" },
      },
      {
        title: { ukr: "Гнучкі умови замовлення" },
        description: { ukr: "Можливість замовити партій з індивідуальним MOQ" },
      },
    ],
  },

  services: {
    title: { ukr: "послуги" },
    description: {
      ukr: "Все, що нам потрібно – це ваша ідея. Ми беремо на себе розробку дизайну та подальшу реалізацію проєкту.",
    },
    caption: {
      ukr: "Надаємо послуги з виробництва взуття на замовлення та контрактного виробництва з нашого каталогу під вашим брендом.",
    },
    slides: [
      {
        title: { ukr: "Створимо дизайн" },
        description: {
          ukr: "Відділ Розробки перетворить ваші ідеї в унікальні моделі взуття, що відображають особливість вашого бренду.",
        },
      },
      {
        title: { ukr: "Підберемо матеріали" },
        description: {
          ukr: "Володіємо технологіями роботи з будь-яким видом шкіри (натуральна, екошкіра, шкірзамінник).",
        },
      },
      {
        title: { ukr: "Працюємо комплексно" },
        description: {
          ukr: "Підберемо необхідні матеріали, фурнітуру та надійних постачальників. ",
        },
      },
      {
        title: { ukr: "Забезпечимо повний супровід" },
        description: {
          ukr: "Надаємо гарантію на нашу продукцію та завжди готові проконсультувати.",
        },
      },
    ],
  },

  products: {
    title: { ukr: "Продукція" },
    caption: { ukr: "Більше інформації" },
    email: "anridecollo@gmail.com",
    action: { ukr: "Завантажити каталог" },
    slides: [
      {
        caption: { ukr: "Кросівки" },
      },
      {
        caption: { ukr: "Чоботи зі шнурівкою" },
      },
      {
        caption: { ukr: "Ботфорти" },
      },
      {
        caption: { ukr: "Лофери" },
      },
      {
        caption: { ukr: "Сандалі" },
      },
    ],
  },

  contact: {
    title: { ukr: "Отримайте консультацію " },
    description: { ukr: "Заповніть форму, і ми звʼяжемось з вами" },
    caption: { ukr: "Наш email" },
    email: "andridecollo@gmail.com",
    form: {
      name: { ukr: "Ім'я" },
      surname: { ukr: "Прізвище" },
      email: "Email",
      action: { ukr: "Надіслати" },
    },
  },

  reviews: {
    title: { ukr: "Відгуки наших клієнтів" },
    slides: [
      {
        name: { ukr: "Анна Мельник" },
        role: { ukr: "Покупець" },
        review: {
          ukr: "Дуже задоволена покупкою! Якість взуття перевершила очікування, натуральна шкіра та зручна посадка. Замовлення доставили швидко, сервіс на високому рівні.",
        },
      },
    ],
  },

  workflow: {
    title: { ukr: "Процес виробництва" },
  },

  faq: {
    title: "FAQ",
    action: { ukr: "Сконтактуйся" },
    items: [
      {
        title: { ukr: "Доставка" },
        description: {
          ukr: 'Ми пропонуємо доставку по всій Україні за допомогою популярних кур\'єрських служб, таких як "Нова Пошта". Термін доставки зазвичай становить 1-3 робочі дні, залежно від вашого місцезнаходження. Після оформлення замовлення ви отримаєте трекінг-номер для відстеження. Оплата доставки здійснюється згідно з тарифами перевізника, але для замовлень на певну суму ми надаємо безкоштовну доставку.',
        },
      },
      {
        title: { ukr: "Яка гарантія на взуття?" },
        description: { ukr: "Яка гарантія на взуття?" },
      },
      {
        title: { ukr: "Чи можна повернути або обміняти товар?" },
        description: { ukr: "Чи можна повернути або обміняти товар?" },
      },
      {
        title: { ukr: "Які способи оплати доступні?" },
        description: { ukr: "Які способи оплати доступні?" },
      },
      {
        title: { ukr: "Чи доступна міжнародна доставка?" },
        description: { ukr: "Чи доступна міжнародна доставка?" },
      },
    ],
  },

  footer: {
    form: {
      cta: { ukr: "Сконтактуйтеся з нами" },
      input: { ukr: "Напишіть повідомлення" },
      action: { ukr: "Надіслати" },
    },
    info: {
      about: [
        { ukr: "Про нас" },
        { ukr: "Переваги" },
        { ukr: "Послуги" },
        { ukr: "Відгуки" },
        { eng: "FAQ" },
      ],
      portfolio: [
        { ukr: "Наше порфтоліо" },
        { ukr: "Продукція" },
        { ukr: "Каталог" },
        { ukr: "Процес" },
      ],
      social: [
        { ukr: "Соцмережі" },
        { eng: "Linkedin" },
        { eng: "Instagram" },
        { eng: "Facebook" },
      ],
    },
  },
};
